# Ejercicios Pair Programming - Módulo 2 Sprint 2
## Lección 4 - LimpiezaIV
### Natalia García Lago y Noemi Azorín

In [1]:
import pandas as pd
import numpy as np
import sidetable as stb

En este caso trabajaremos con el dataframe que limpiamos en el ejercicio de pair de Limpieza anterior, el de Limpieza III, donde limpiabamos las columnas de species, age, etc. y eliminabamos los outliers.

Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming de EDA para dirigir nuestro análisis.


- ¿Es Australia es el sitio más peligroso y letal para estar relajada en la playa?


- ¿Cuál es el rango de edad que sufre la mayoría de los ataques?


- Independientemente de la edad, sufren los hombres más ataques que las mujeres?


- ¿En qué mes ocurren más ataques?


- ¿Cuál es la relación entre la especie y el tipo de ataque (si es fatal o no)?


- ¿Cómo han evolucionado los ataques a lo largo del tiempo?


De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no. **Actualizamos esta tabla ya que en el ejercicio de pair de Limpieza I ya dejamos algunas columnas limpitas:

Es el momento de ponernos a trabajar con los valores nulos 💪🏽. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lección hemos aprendido varios métodos, nosotras os planteamos los ejercicios pero sentiros libres de usar el método que más se adapte a vuestras necesidades. Manos a la obra!

In [2]:
ataques = pd.read_csv("../ficheros/ataques_limpiezaIII.csv", index_col = 0 )
ataques.head(1)

,case_number,year,type,country,activity,age,species,mes,fatal,sex,especies,edad
0,2018.06.25,2018,Boating,usa,Paddling,57,White shark,Jun,N,F,tiburón blanco,57.0

1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¿Hay alguna columna con una gran cantidad de nulos? En caso de que sea así deberemos eliminarla.

In [3]:
#Utilizamos el método missing de la librería sidetable para visualizar tanto el total de nulos como este en porcentaje.
nulos = ataques.stb.missing()
nulos

             missing  total    percent
mes              218   1672  13.038278
edad             215   1672  12.858852
age              154   1672   9.210526
species          126   1672   7.535885
especies         126   1672   7.535885
fatal             97   1672   5.801435
activity          31   1672   1.854067
sex               15   1672   0.897129
country           10   1672   0.598086
case_number        0   1672   0.000000
year               0   1672   0.000000
type               0   1672   0.000000

2. Es el momento de eliminar los nulos:


    - Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.


    - En relación a la columna de country al tratarse de una columna de tipo categórica, reemplazad los valores nulos por una nueva categória que se llame Unknown.


    - Reemplazad los valores nulos de la columna fatal por Unknown.


    - Reemplazad los valores nulos de la columna type por el valor más frecuente (la moda).


    - Reemplazad los valores nulos de la columna fecha por Unknown.

In [4]:
#Reemplazo de la columna age por media de la columna edad con dos decimales 
# Sacamos la media de la columna edad.
media_edad = ataques["edad"].mean().round(2)

In [5]:
# Realizamos el reemplazo y comprobamos que se han realizado los cambios y nuestro porcentaje de nulos es 0 en la columna age.
ataques["age"].replace(np.nan, media_edad, inplace = True)
ataques.stb.missing()

             missing  total    percent
mes              218   1672  13.038278
edad             215   1672  12.858852
species          126   1672   7.535885
especies         126   1672   7.535885
fatal             97   1672   5.801435
activity          31   1672   1.854067
sex               15   1672   0.897129
country           10   1672   0.598086
case_number        0   1672   0.000000
year               0   1672   0.000000
type               0   1672   0.000000
age                0   1672   0.000000

In [6]:
# Reemplazar nulos en columna Country por una nueva categoría "unknown"
ataques["country"].replace(np.nan, "unknown", inplace = True)
ataques.stb.missing()

             missing  total    percent
mes              218   1672  13.038278
edad             215   1672  12.858852
species          126   1672   7.535885
especies         126   1672   7.535885
fatal             97   1672   5.801435
activity          31   1672   1.854067
sex               15   1672   0.897129
case_number        0   1672   0.000000
year               0   1672   0.000000
type               0   1672   0.000000
country            0   1672   0.000000
age                0   1672   0.000000

In [7]:
# Reemplazo de nulos en columna fatal por "unknown"
ataques["fatal"].replace(np.nan, "unknown", inplace = True)
ataques.stb.missing()

             missing  total    percent
mes              218   1672  13.038278
edad             215   1672  12.858852
species          126   1672   7.535885
especies         126   1672   7.535885
activity          31   1672   1.854067
sex               15   1672   0.897129
case_number        0   1672   0.000000
year               0   1672   0.000000
type               0   1672   0.000000
country            0   1672   0.000000
age                0   1672   0.000000
fatal              0   1672   0.000000

In [8]:
# Reemplazo de los nulos de la columna type por la moda
# moda_type = ataques["type"].mode()
# ataques["type"].replace(np.nan, moda_type, inplace = True)

-- Nuestra columna type no contiene nulos. Arriba mostramos el código que hubiéramos utilizado para hacer el reemplazo.

In [9]:
# Reemplazo de los nulos de la columna mes por unknown 
# ataques["mes"].replace(np.nan, "unknown", inplace = True)
# ataques.stb.missing()

-- Nuestras columnas mes, case_number y year no contienen nulos. Arriba mostramos el código que hubiéramos utilizado para hacer el reemplazo.

In [10]:
ataques

,case_number,year,type,country,activity,age,species,mes,fatal,sex,especies,edad
0,2018.06.25,2018,Boating,usa,Paddling,57,White shark,Jun,N,F,tiburón blanco,57.0
1,2018.06.03.a,2018,Unprovoked,brazil,Swimming,18,Tiger shark,Jun,Y,M,tiburón tigre,18.0
2,2018.05.26.b,2018,Unprovoked,usa,Walking,15,"Bull shark, 6'",May,N,M,tiburón toro,15.0
3,2018.05.24,2018,Provoked,australia,Feeding sharks,32,Grey reef shark,May,N,M,tiburón gris,32.0
4,2018.05.13.a,2018,Invalid,england,Fishing,21,Invalid incident,May,N,M,unspecified,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...
1667,ND.0005,1997,Unprovoked,australia,Diving,28.36,NaN,NaN,Y,M,NaN,NaN
1668,ND.0004,1997,Unprovoked,australia,Pearl diving,28.36,NaN,NaN,Y,M,NaN,NaN
1669,ND.0003,1997,Unprovoked,usa,Swimming,28.36,NaN,NaN,Y,M,NaN,NaN
1670,ND.0002,1997,Unprovoked,panama,NaN,28.36,NaN,NaN,Y,M,NaN,NaN
1671,ND.0001,1997,Unprovoked,ceylon (sri lanka),Swimming,15,NaN,NaN,Y,M,NaN,15.0

3. Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair.

In [11]:
ataques.to_csv("../ficheros/ataques_limpiezaIV.csv")